tutorials/dbsSimpleFoam/constrictedTube/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 0.1; // kinematic -> 0.002 dynamic


porousMediaProperties
{
	absolutePermeabilityModel KozenyCarman;
	KozenyCarmanCoeffs
	{}


	surfaceAreaModel none;
	dispersionModel none;

}

activateHeleShaw false;
HeleShawCoeffs
{
	h h [0 1 0 0 0 0 0] 10e-6;
}

// ************************************************************************* //
